[
    {
        "id": 1,
        "category": "Tech Conferences and Expos",
        "title": "TechWorld Expo 2023",
        "date": "2023-11-20",
        "location": "San Francisco, CA",
        "description": "The largest tech expo featuring the latest innovations and trends.",
        "registrationLink": "https://example.com/techworld-expo",
        "image": "https://i.ibb.co/nj5t25F/headway-F2-KRf-Qf-Cqw-unsplash.jpg",
        "briefDescription": "Tech conferences are dynamic and immersive events that bring together industry experts, innovators, and enthusiasts from across the tech world. These conferences serve as platforms for sharing knowledge, networking, and exploring the latest trends and developments in technology"
    },
    {
        "id": 3,
        "category": "Gaming Conventions",
        "title": "E3 2024",
        "date": "2024-06-12",
        "location": "Los Angeles, CA",
        "description": "The ultimate gaming convention showcasing upcoming game releases.",
        "registrationLink": "https://example.com/e3-2024",
        "image": "https://i.ibb.co/brx9dWh/alex-haney-Bh-QZrx-Dq9oo-unsplash.jpg",
        "briefDescription": "Gaming conventions, often known as gaming cons are events where gaming enthusiasts, developers, publishers, and industry professionals gather to celebrate and explore the world of video games. These conventions provide a platform for various activities"
    },
    {
        "id": 4,
        "category": "Hackathons",
        "title": "CodeFest 2024",
        "date": "2024-04-15",
        "location": "Online",
        "description": "A 24-hour coding competition for programmers and developers.",
        "registrationLink": "https://example.com/codefest-2024",
        "image": "https://i.ibb.co/vX5J8zN/Hackathon-USP.webp",
        "briefDescription": "A hackathon is an event where individuals or teams of programmers, designers, and other tech enthusiasts come together to collaborate intensively on software or hardware projects. These events typically have a set duration, which can range from a few hours to several days"
    },
    {
        "id": 5,
        "category": "Gaming Tournaments",
        "title": "CS:GO Championship Series",
        "date": "2023-12-10",
        "location": "Online",
        "description": "Compete in a Counter-Strike: Global Offensive tournament and win prizes.",
        "registrationLink": "https://example.com/csgo-championship",
        "image": "https://i.ibb.co/dcGL5BK/gaming-tournaments.jpg",
        "briefDescription": "A gaming tournament is a competitive event in which individuals or teams compete against each other in various video games, often with the goal of winning prizes, recognition, and sometimes financial rewards. These tournaments have become increasingly popular, especially with the rise of esports, where professional players and teams compete at a high level."
    },
    {
        "id": 6,
        "category": "Community Meetups",
        "title": "Tech Enthusiast Meetup",
        "date": "2024-02-25",
        "location": "Seattle, WA",
        "description": "Connect with fellow tech enthusiasts and discuss the latest tech trends.",
        "registrationLink": "https://example.com/tech-meetup",
        "image": "https://i.ibb.co/pft9cn4/meet-up.jpg",
        "briefDescription": "A community meetup is a gathering of individuals who share common interests, goals, or affiliations within a specific community or group. These meetups provide an opportunity for members of a community to come together in person, foster connections, and engage in discussions or activities related to their shared interests"
    },
    {
        "id": 7,
        "category": "Tech and Gaming Product Showcases",
        "title": "Gadget Expo 2023",
        "date": "2023-10-05",
        "location": "Chicago, IL",
        "description": "See the newest tech gadgets and gaming products on the market.",
        "registrationLink": "https://example.com/gadget-expo",
        "image": "https://i.ibb.co/0DWZBgv/showcasee.jpg",
        "briefDescription": "A tech and gaming product showcase is an event or platform where companies and developers present their latest technology and gaming products to an audience of enthusiasts, industry professionals, and potential consumers. These showcases are essential for launching and promoting new products, generating excitement, and connecting with the target audience"
    }
]